{
    "courses": [
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "105",
            "courseTitle": "ENVIRONMENTAL BIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Introduction of the relationships between humans and the environment. Fundamentals of ecology, hydrology, demography, energy, and nutrient cycling will be covered, as well as the human impact on the use of the Earth's land, water and air resources. An emphasis is placed on five key themes: Human Population; Sustainability; Global Perspective; Urban World; and Values and Knowledge. Core: Biological & Physical Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "117",
            "courseTitle": "HONORS BIOLOGY: THE SCIENCE OF LIFE",
            "termsOffered": "Spring",
            "description": "A broad-based, investigative course designed to introduce important issues in the biological sciences to the non-scientist. Major topics include human genetics, evolution, ecology, and environmental issues. Three hours of lecture and two hours of laboratory per week. Not for students intending to pursue additional coursework in Biology nor for students from the College of Health Professions who require BIOL 221/ BIOL 221L & BIOL 222/ BIOL 222L and/or BIOL 315. Not for credit toward Biology major or minor. Not open to those who successfully completed BIOL 115, BIOL 120/ BIOL 120L, BIOL 201 or BIOL 200/ BIOL 200L. Prerequisite: admission to the Honors College. Core: Biological & Physical Sciences. Lab/Class fee will be assessed.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Admission to the Honors College"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "120",
            "courseTitle": "PRINCIPLES OF BIOLOGY [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Biological principles common to plants and animals. Topics include scientific investigation, genetics, evolution, ecology and ethical issues in contemporary biology. Not for credit toward Biology major or minor. Not open to those who have successfully completed BIOL 115, BIOL 201 or BIOL 200/ BIOL 200L. Students who have successfully completed the honors version of this course (BIOL 117) will not receive additional credit for this course. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 120L. Core: Biological and Physical Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["BIOL 120L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "120L",
            "courseTitle": "PRINCIPLES OF BIOLOGY [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Biological principles common to plants and animals. Topics include scientific investigation, genetics, evolution and ecology. Not for credit toward Biology major or minor. Not open to those who have successfully completed BIOL 110, 115, 201 or BIOL 200/ BIOL 200L. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 120 (lecture). Successful completion of both satisfies. Core: Lab and Non-Lab Sciences. Lab/Class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["BIOL 120"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "191",
            "courseTitle": "INTRODUCTORY BIOLOGY FOR HEALTH PROFESSIONS [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Basic principles of biology including process of scientific investigation, cells, macromolecules, metabolism, DNA, genetics, evolution, and ecology. Intended for CHP majors who will take additional biology courses. Not for Biology major/minor credit. Not open to those who successfully completed BIOL 201, BIOL 200 or BIOL 200L. Core credit not given for both BIOL 191/ BIOL 191L and BIOL 120/ BIOL 120L. CHP major credit given to those who complete either BIOL 190 or BIOL 191 and BIOL 191L. Students who have successfully completed the honors version of this course (BIOL 192) will not receive additional credit for this course. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 191L. Prerequisites: limited to specific majors in CHP; qualifying score on Math Placement or MATH 100 or concurrent enrollment with MATH 102 or higher. Core: Lab & Non-Lab Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 100", "MATH 102"],
            "corequisites": ["BIOL 191L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "191L",
            "courseTitle": "INTRODUCTORY BIOLOGY FOR HEALTH PROFESSIONS [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Basic principles of biology including process of scientific investigation, cells, macromolecules, metabolism, DNA, genetics, evolution, and ecology. Average of three laboratory hours per week. Intended for CHP majors who will take additional biology courses. Not for Biology major/minor credit. Not open to those who successfully completed BIOL 200/ BIOL 200L or BIOL 201. Core credit not given for both BIOL 191/ BIOL 191L and BIOL 120/ BIOL 120L. CHP major credit given to those who complete either BIOL 190 or BIOL 191/ BIOL 191L. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Prerequisites: CHP major; qualifying score on Math Placement or MATH 100 or concurrent enrollment with MATH 102 or higher. Core: Biological & Physical Sciences. Lab/Class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 100", "MATH 102"],
            "corequisites": ["BIOL 191"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "192",
            "courseTitle": "HONORS INTRODUCTORY BIOLOGY FOR THE HEALTH PROFESSIONS",
            "termsOffered": "Fall & Spring",
            "description": "Basic principles of biology including process of scientific investigation, cells, macromolecules, metabolism, DNA, genetics, evolution, and ecology. Intended for College of Health Professions majors who will take additional biology courses. Not for Biology major/minor credit. Students who have successfully completed the non-honors version of this course will not receive additional credit for this course. Not open to those who successfully completed BIOL 201 or BIOL 200/ BIOL 200L. Core: Biological & Physical Sciences. Honors College course. Lab/Class fee will be assessed.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Admission to the Honors College"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "200",
            "courseTitle": "BIOLOGY I: INTRODUCTION TO CELLULAR BIOLOGY AND GENETICS [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "An introduction to biology, including biologically important molecules, cell and tissue structure, respiration, photosynthesis, mitosis, meiosis and genetics. Course designed for Biology and related science majors; taking this course to fulfill Core credit generally not advised (see BIOL 120/ BIOL 120L as alternative). Core credit not given for both BIOL 200/ BIOL 200L and BIOL 120/ BIOL 120L. Students who have successfully completed the honors version of this course (BIOL 203) will not receive additional credit for this course. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 200L. Prerequisites: qualifying score on the Math Placement exam into MATH 115 or higher, or successful completion of MATH 102.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 102"],
            "corequisites": ["BIOL 200L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "200L",
            "courseTitle": "BIOLOGY I: INTRODUCTION TO CELLULAR BIOLOGY AND GENETICS [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "An introduction to biology, including biologically important molecules, cell and tissue structure, respiration, photosynthesis, mitosis, meiosis and genetics. Average of three laboratory hours per week. Course designed for Biology and related science majors; taking this course to fulfill Core credit generally not advised (see BIOL 120/ BIOL 120L as alternative). Core credit not given for both BIOL 200/ BIOL 200L and BIOL 120/ BIOL 120L. Core: Lab and Non-Lab Sciences. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 200. Prerequisites: qualifying score on the Math Placement exam into MATH 115 or higher, or successful completion of MATH 102. Lab/Class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 102"],
            "corequisites": ["BIOL 200"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "203",
            "courseTitle": "HONORS BIOLOGY I: CELLULAR BIOLOGY AND GENETICS",
            "termsOffered": "Fall",
            "description": "An introduction to biology, including biologically important molecules, cell and tissue structure, respiration, photosynthesis, mitosis, meiosis and genetics. Average of three laboratory hours per week. Major credit not given for BIOL 201 or BIOL 200/BIOL 200L. Honors College Course. Students who have successfully completed the non-honors version of this course will not receive additional credit for this course. Prerequisites: qualifying score on the Math Placement exam into MATH 115 or higher, or successful completion of MATH 102.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 102"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "204",
            "courseTitle": "EDUCATIONAL AND CAREER PLANNING FOR THE BIOLOGIST",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "Exploration of undergraduate educational opportunities, graduate and professional education, career options, and career preparation in the Biological Sciences.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "205",
            "courseTitle": "GENERAL BOTANY",
            "termsOffered": "Spring",
            "description": "Plant structure, development, reproduction and diversity of life forms by interrelating hormones, physiological processes and environmental relationships with respect to the whole plant. Emphasis on flowering plants. Average of three laboratory or discussion hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200", "BIOL 200L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "206",
            "courseTitle": "BIOLOGY II: INTRODUCTION TO ECOLOGY AND EVOLUTION [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Population dynamics, community patterns and processes, origin and diversity of species, natural selection, speciation, and population genetics. Course designed for BIOL and related science majors; taking this course to fulfill Core credit generally not advised (see BIOL 120 and BIOL 120L as alternative). Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 206L (lab).",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200", "BIOL 200L"],
            "corequisites": ["BIOL 206L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "206L",
            "courseTitle": "BIOLOGY II: INTRODUCTION TO ECOLOGY AND EVOLUTION [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Gathering biological data; developing testable hypotheses and quantitative analysis of biological data. Three laboratory hours per week. Course designed for BIOL and related science majors; taking this course to fulfill GenEd credit generally not advised (see BIOL 120 and BIOL 120L as alternative). Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 206 (lecture).",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200", "BIOL 200L"],
            "corequisites": ["BIOL 206"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "207",
            "courseTitle": "GENERAL ZOOLOGY",
            "termsOffered": "Fall",
            "description": "Major animal phyla. A comparative approach to the structure, function, development and ecology of the animal kingdom. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "208",
            "courseTitle": "BIODIVERSITY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Phylogenetics and the evolution of major groups of organisms: brief survey of representatives of phyla from the three domains; development and the evolution of form; case studies on form and function; the biodiversity crisis. Three lecture hours a week.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200", "BIOL 200L", "BIOL 206", "BIOL 206L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "210",
            "courseTitle": "MEDICAL TERMINOLOGY",
            "termsOffered": "Winter & Summer",
            "description": "An interactive online study of the language of medicine including word parts, compound word construction, and medical terms used to describe the major body systems as used in medical records, documents, and discussions among medical professionals. Intended for students planning to apply to graduate school in some area of biomedicine, e.g. physician assistant school; medical, dental, or veterinary school; or a graduate program in a biomedical research field. At the completion of this course, students are expected to correctly use medical terms in both written and oral communication.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "215",
            "courseTitle": "ESSENTIALS OF MICROBIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Pathogenesis of bacteria and viruses, their interactions with the human body, and methods of treatment and prevention. Three hours of laboratory per week. Recommended for Health Science majors. Not for Biology major credit.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 191", "BIOL 191L", "BIOL 192", "BIOL 192L", "BIOL 200", "BIOL 200L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "220",
            "courseTitle": "ESSENTIALS OF HUMAN ANATOMY AND PHYSIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Provides an overview of human anatomy and physiology through the study of the structure and function of the human body. Human organ systems: integumentary, skeletal, nervous, muscular, endocrine, immune, cardiovascular, respiratory, digestive, urinary and reproductive systems will be examined. This course is open only to students in the Health Education and Promotion major. This course is not equivalent to BIOL 221/ BIOL 221L or BIOL 222/ BIOL 222L and cannot replace one or both of these courses.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 191", "BIOL 191L", "BIOL 200", "BIOL 200L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "221",
            "courseTitle": "HUMAN ANATOMY & PHYSIOLOGY I [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Cell biology, histology, skeletal, muscular, and nervous systems. Course enrollment is limited to two attempts including audits and withdrawals. Exceptions to this limit may be requested by contacting the Course Coordinator. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 221L (lab).",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 191", "BIOL 191L", "MATH 100"],
            "corequisites": ["BIOL 221L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "221L",
            "courseTitle": "HUMAN ANATOMY & PHYSIOLOGY I [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Cell biology, histology, skeletal, muscular, and nervous systems. Average of three laboratory hours per week. Course enrollment is limited to two attempts including audits and withdrawals. Exceptions to this limit may be requested by contacting the Course Coordinator. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 221 (lecture).",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 191", "BIOL 191L", "BIOL 192", "BIOL 200", "BIOL 200L"],
            "corequisites": ["BIOL 221"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "222",
            "courseTitle": "HUMAN ANATOMY & PHYSIOLOGY II [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Cardiovascular, respiratory, digestive, excretory, endocrine and reproductive systems. Course enrollment is limited to two attempts including audits and withdrawals. Exceptions to this limit may be requested by contacting the Course Coordinator. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 222L (lab).",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 221", "BIOL 221L"],
            "corequisites": ["BIOL 222L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "222L",
            "courseTitle": "HUMAN ANATOMY & PHYSIOLOGY II [LAB]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Cardiovascular, respiratory, digestive, excretory, endocrine and reproductive systems. Average of three laboratory hours per week. Course enrollment is limited to two attempts including audits and withdrawals. Exceptions to this limit may be requested by contacting the Course Coordinator. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: BIOL 222 (lecture).",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 221", "BIOL 221L"],
            "corequisites": ["BIOL 222"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "301",
            "courseTitle": "FIELD AND NATURAL SCIENCE",
            "termsOffered": "Fall",
            "description": "Physical and biological components of various environments and their interrelationships with each other and humans. Emphasis on field studies observation with the application of findings to classroom teaching and learning in the elementary and middle school classroom. Intended for Middle School education majors and environmental science and studies majors in the informal environmental education track only. Not for credit towards BIOL major or minor.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 117",
                "BIOL 120",
                "BIOL 120L",
                "BIOL 191",
                "BIOL 191L",
                "BIOL 192",
                "BIOL 200",
                "BIOL 200L",
                "BIOL 206",
                "BIOL 206L",
                "BIOL 203"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "303",
            "courseTitle": "LIFE SCIENCES",
            "termsOffered": "Fall & Spring",
            "description": "Living organisms in the environment, emphasizing modes of scientific inquiry and the utilization of living organisms in the classroom. Not for credit toward the Biology major or minor.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 120",
                "BIOL 120L",
                "BIOL 191",
                "BIOL 191L",
                "BIOL 200",
                "BIOL 200L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "304",
            "courseTitle": "NATURAL HISTORY INTERPRETATION AND PUBLIC ENVIRONMENTAL EDUCATION",
            "termsOffered": "Spring-Odd Years Only",
            "description": "Overview of public education in the biological sciences at local organizations such as zoos, parks, and aquaria. Emphasis on basic ecological concepts and how these concepts are presented to the general public, especially school-age children. Field experience at a local nature center outside of class time is required.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "305",
            "courseTitle": "ELECTRON MICROSCOPY",
            "termsOffered": "Not Currently Offered",
            "description": "Theory, preparation, and application of the electron microscope, including light microscopy. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "12 credits of biology",
                "PHYS 211",
                "PHYS 212"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "306",
            "courseTitle": "HUMAN ECOLOGY AND SUSTAINABILITY",
            "termsOffered": "Spring",
            "description": "Relationships and sustainability of human society and natural ecosystems. Relevant scientific, socioeconomic and ethical issues will be examined in current events like climate change, energy policy, and urban planning. Cannot be taken for Biology major credit.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 105",
                "BIOL 115",
                "BIOL 191",
                "BIOL 191L",
                "BIOL 190",
                "BIOL 200",
                "BIOL 200L",
                "BIOL 206",
                "BIOL 206L",
                "CHEM 104"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "309",
            "courseTitle": "GENETICS",
            "termsOffered": "Fall & Spring",
            "description": "Problem-based genetics: Mendelian genetics, genetic linkage and mapping, nucleic acid structure, replication and function, protein synthesis and the genetic code, gene expression and regulation, mutation, repair, and recombination, recombinant DNA technology, and population genetics. Includes average of two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 200",
                "BIOL 200L",
                "BIOL 206",
                "BIOL 206L",
                "CHEM 131",
                "CHEM 131L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "310",
            "courseTitle": "CONSERVATION BIOLOGY",
            "termsOffered": "Spring",
            "description": "Application of ecological theory to conservation of biological diversity. Exploration of past and present processes leading to and maintaining diversity and how such processes are impacted by human disturbance. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 206",
                "BIOL 206L",
                "BIOL 202",
                "BIOL 205",
                "BIOL 207",
                "BIOL 208",
                "CHEM 131",
                "CHEM 131L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "318",
            "courseTitle": "MICROBIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Biology of microorganisms with emphasis on bacteria. Microbial morphology, physiology and genetics, and the role of microorganisms in natural processes and disease. Laboratory includes methods of observing, isolating, and identifying bacteria. Average of three laboratory hours per week. Either this course or BIOL 315, but not both, may count toward Biology major or M.S. degree in Biology.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 309",
                "CHEM 132",
                "CHEM 132L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "325",
            "courseTitle": "ANIMAL PHYSIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Animal structure and function from molecular to organismic levels. Emphasizing comparative strategies and adaptations of various animal groups in their environments; response of integrated systems to changes in the physical and chemical environment; environmental physiology.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 207",
                "BIOL 208",
                "BIOL 309",
                "CHEM 132",
                "CHEM 132L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "327",
            "courseTitle": "DANGEROUS DISEASES",
            "termsOffered": "Not Currently Offered",
            "description": "Microorganisms and their roles in diseases. Human impact on the environment relating to emerging diseases; biotechnological techniques; ethical issues. Not for credit toward Biology major, minor, or MS in Biology.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 110",
                "BIOL 112",
                "BIOL 115",
                "BIOL 190",
                "BIOL 201"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "334",
            "courseTitle": "HUMANS, SCIENCE AND THE CHESAPEAKE BAY",
            "termsOffered": "Fall-Even Years Only",
            "description": "Conflicts between human use of the Chesapeake Bay watershed, Bay water quality, and effects on Bay natural resources; emphasis on understanding the dynamics of this ecosystem and the role science plays in political decisions affecting the Bay.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 205",
                "BIOL 207",
                "BIOL 208",
                "BIOL 206",
                "BIOL 206L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "342",
            "courseTitle": "HUMAN ANATOMY AND PHYSIOLOGY I FOR BIOLOGY MAJORS",
            "termsOffered": "Fall & Spring",
            "description": "Application-based approach to learning with emphasis on the development of quantitative skills, critical thinking, data analysis, and concept integration. Topics include cell biology, histology, skeletal, muscular, and nervous systems. Three laboratory/recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 309"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "343",
            "courseTitle": "HUMAN ANATOMY AND PHYSIOLOGY II FOR BIOLOGY MAJORS",
            "termsOffered": "Fall & Spring",
            "description": "Application-based approach to learning with emphasis on the development of quantitative skills, critical thinking, data analysis, and concept integration. Topics include cardiovascular, respiratory, digestive, excretory, endocrine, and reproductive systems. Three laboratory/recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 342"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "347",
            "courseTitle": "MARINE BIOLOGY",
            "termsOffered": "Spring",
            "description": "Major features of the marine environment emphasizing biological aspects and specific adaptations of marine organisms.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 205",
                "BIOL 207",
                "BIOL 208",
                "CHEM 131",
                "CHEM 131L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "353",
            "courseTitle": "INVERTEBRATE ZOOLOGY",
            "termsOffered": "Fall-Odd Years Only",
            "description": "Examination of the evolutionary history and phylogenetic relationships of the animals, including the origin of the animals and their place among eukaryotic life. This will include study of structure and function, general ecology and life history strategies of selected invertebrate animal groups. Laboratory emphasizes learning techniques for sampling various invertebrate taxa in natural settings. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 206",
                "BIOL 206L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "355",
            "courseTitle": "ANIMAL PARASITOLOGY",
            "termsOffered": "Spring",
            "description": "Major groups of animal parasites and their vectors. Emphasis will be placed on pathogenesis of medically relevant organisms. Lecture discussions will incorporate an examination of relevant primary literature.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 309"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "360",
            "courseTitle": "HISTOLOGY",
            "termsOffered": "Occasionally",
            "description": "Tissues of the vertebrate body.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 343",
                "BIOL 325"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "365",
            "courseTitle": "HUMAN PATHOPHYSIOLOGY",
            "termsOffered": "Spring-Even Years Only",
            "description": "Designed to look at the most prevalent diseases in the U.S. population, studying their pathophysiology at the molecular, cellular, and organismal level. Disease etiology, symptoms, diagnostic procedures, and treatments will be discussed. Current research topics focus on new diagnostic techniques, including cellular imaging, as well as new treatments, including stem cell therapy.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 222",
                "BIOL 222L",
                "BIOL 325",
                "BIOL 343",
                "BIOL 309"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "367",
            "courseTitle": "ENDOCRINOLOGY",
            "termsOffered": "Occasionally",
            "description": "Endocrine mechanisms regulating homeostasis and functional integrity of animals with emphasis on vertebrates.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 309",
                "BIOL 325",
                "BIOL 343",
                "CHEM 132",
                "CHEM 132L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "371",
            "courseTitle": "ANIMAL BEHAVIOR",
            "termsOffered": "Fall",
            "description": "Introduction to the modern study of behavior including the development and control of behavior, as well as the evolution and adaptive value of behavior. Two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "BIOL 207",
                "BIOL 208",
                "BIOL 206",
                "BIOL 206L"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "381",
            "courseTitle": "WRITING IN THE BIOLOGICAL SCIENCES",
            "termsOffered": "Occasionally",
            "description": "Practicum on writing in the scientific style appropriate for biology. Includes detailed analysis and critical written summation of primary research literature in biology. Not for major or minor credit or M.S. degree in Biology. Requires grade of C or better to fulfill Core requirement.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "ENGL 102",
                "ENGL 190",
                "60 completed units",
                "16 units in biology"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "382",
            "courseTitle": "ENVIRONMENTAL EDUCATION AND SERVICE LEARNING IN THE TROPICS",
            "termsOffered": "Summer",
            "description": "Designed for majors in Science or Education with an interest in Environmental Education; course work will take place in Costa Rica; emphasis on tropical forest ecology concepts applicable to PreK-12 environmental education and management of tropical natural resources.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "Minimum Junior status",
                "Consent of the instructor"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "389",
            "courseTitle": "CURRENT DEVELOPMENTS IN BIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Current directions of research in a major area of the biological sciences. Sufficient background will be studied for the appreciation of the significance of these developments.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [
                "Consent of department"
            ],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "402",
            "courseTitle": "GENERAL ECOLOGY",
            "termsOffered": "Fall",
            "description": "Effects of the abiotic environment on distribution and abundance of organisms; organization of biological communities; ecosystems and global change; application of ecological principles to natural resource management. Some daylong trips required.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "CHEM 131", "CHEM 131L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "403",
            "courseTitle": "ADV GENETICS",
            "termsOffered": "Not Currently Offered",
            "description": "Emphasis on the molecular basis of gene action. Discussion of current work and methods related to the problem of gene structure, function, and mutation including the translation and regulation of genetic information.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "405",
            "courseTitle": "MOLECULAR ECOLOGY, EVOLUTION AND CONSERVATION",
            "termsOffered": "Fall",
            "description": "Examination of applications of modern molecular techniques in ecology, evolution, behavior, and conservation biology. Emphasis will be on how application of these techniques provides greater insight in these areas of study. Includes average of two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "406",
            "courseTitle": "LIMNOLOGY",
            "termsOffered": "Occasionally",
            "description": "Ecology of streams and lakes: physical, chemical, and biological factors that affect communities of freshwater organisms; laboratory and field experience in methods used to analyze aquatic systems.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 205", "BIOL 207", "BIOL 208", "CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "408",
            "courseTitle": "CELL BIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "The molecular and morphological organization of the cell in relationship to cellular activities with emphasis on eukaryotic cells. Includes average of two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "409",
            "courseTitle": "MOLECULAR BIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Molecular basis of genetic inheritance and gene expression. DNA and RNA structure, DNA replication, sources and mechanisms of mutation and repair. Genome structure and organization in viruses, prokaryotes, and eukaryotes. Includes average of two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "410",
            "courseTitle": "MOLECULAR BIOLOGY LABORATORY",
            "termsOffered": "Fall & Spring",
            "description": "Modern molecular genetic research techniques. The theoretical and practical considerations of the organisms and enzymes used in molecular biology, gene cloning strategies, DNA sequencing and analysis, analysis of genome structure and gene expression, gene subcloning, and transgenic organisms.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "411",
            "courseTitle": "CANCER BIOLOGY",
            "termsOffered": "Fall",
            "description": "Current concepts and knowledge of cancer, including cancer research and treatment. Will utilize lecture, review of journal articles to examine both the clinical and molecular aspects underlying cancer development with the aim of understanding how changes in the normal growth and division processes lead to tumorigenesis.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "412",
            "courseTitle": "CELL BIOLOGY LABORATORY",
            "termsOffered": "Spring",
            "description": "Current laboratory techniques used for the study of cell structure and function. Theoretical and practical considerations for the growth and maintenance of eukaryotic cells and the analysis of gene expression, protein interactions, cell signaling and cell-cell contacts.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "413",
            "courseTitle": "EVOLUTION",
            "termsOffered": "Spring",
            "description": "Concepts of biological evolution, the history of the development of these concepts, and current topics in revolutionary biology.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 205", "BIOL 207", "BIOL 208", "BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "415",
            "courseTitle": "BIOTECHNOLOGY",
            "termsOffered": "Occasionally",
            "description": "Application of molecular biology in the areas of agriculture, medicine, and ecology/environmental biology. Government regulations, ethical implications and patent issues will also be addressed.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "417",
            "courseTitle": "METABOLIC PATHWAYS",
            "termsOffered": "Summer",
            "description": "Physiology of cellular metabolism with a focus on intracellular metabolic switching and metabolic mapping. Current research will be discussed as it relates to the metabolic activity of cells, and the effects of that activity on the organism as a whole.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "418",
            "courseTitle": "GENETIC ANALYSIS IN MEDICINE",
            "termsOffered": "Spring",
            "description": "A research-based course focused on using de-identified genetic, environmental, bio-specimen, and electronic health record data to investigate relationships between molecular biology/genetics and human health, especially in populations usually underrepresented in biomedical studies.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "MATH 231", "MATH 237", "PSYC 212"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "419",
            "courseTitle": "ENVIRONMENTAL MICROBIOLOGY",
            "termsOffered": "Spring-Even Years Only",
            "description": "Biology and ecology of microorganisms in natural and anthropogenic environments. Culture-based and molecular methods for detection, evaluation, and manipulation of microorganisms and their metabolism.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "420",
            "courseTitle": "MICROBIOLOGY OF INFECTIOUS DISEASE",
            "termsOffered": "Fall",
            "description": "Cell and molecular biology of microorganisms that cause life-threatening disease. Topics include in-depth explorations of bacteria, protozoa, helminths, viruses, and fungi that infect humans, plants, and animals.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "421",
            "courseTitle": "IMMUNOLOGY",
            "termsOffered": "Fall",
            "description": "Cells and organs of the immune system, antibody-antigen interactions, immunoglobulin gene organization, B-cell maturation and activation, Major Histocompatibility Complex, cytokines, complement, inflammation, hypersensitivity, vaccines, autoimmunity, and immunodeficiencies.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "BIOL 408", "BIOL 409"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "425",
            "courseTitle": "DISSECTION OF THE UPPER EXTREMITY",
            "termsOffered": "Winter",
            "description": "Gross anatomical dissection of the human upper extremity including the muscles, nerves and blood vessels which supply the appendage. Special emphasis will be placed on development of techniques which assure careful and accurate dissection.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 221", "BIOL 221L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "427",
            "courseTitle": "NEUROMUSCULAR MECHANISMS OF THE UPPER BODY",
            "termsOffered": "Fall",
            "description": "Gross anatomy of the human upper extremity and cranial nerves. Upper extremity emphasis includes muscle action, innervation, and major spinal cord pathways.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 221", "BIOL 221L", "BIOL 342"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "428",
            "courseTitle": "VIROLOGY",
            "termsOffered": "Spring",
            "description": "Cell and molecular biology of viruses. General virology, including pathogenesis and mortality, interaction with the immune system, and some medically relevant viruses.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 318", "BIOL 408", "BIOL 409", "BIOL 410", "BIOL 412"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "432",
            "courseTitle": "VASCULAR PLANT TAXONOMY",
            "termsOffered": "Fall-Even Years Only",
            "description": "A study of the history and principles of vascular plant systematics with laboratory time devoted to collection and identification of plants in the local flora. An average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 205", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "435",
            "courseTitle": "PLANT ECOLOGY",
            "termsOffered": "Occasionally",
            "description": "Environmental factors and processes which control plant distribution, plant communities, and vegetational biomes of North America. An average of 3 laboratory hours per week with 2 required 3-day weekend field trips and a Saturday field trip emphasizing examples from Maryland and the Mid-Atlantic states.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 205", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "436",
            "courseTitle": "PLANT PHYSIOLOGY",
            "termsOffered": "Occasionally",
            "description": "Life functions of plants as related to structure at all levels: cells, organs, and the complete organism. Consideration of the interaction of environmental and genetic factors on plant metabolism.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 205", "BIOL 208", "BIOL 309", "CHEM 330"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "444",
            "courseTitle": "WILDLIFE MANAGEMENT",
            "termsOffered": "Occasionally",
            "description": "Comprehensive introduction to the management, ecology, and behavior of wildlife species. Although regional species will often be used as examples, the course will emphasize principles that can be applied on a world-wide basis.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 309", "BIOL 402"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "446",
            "courseTitle": "TROPICAL ECOLOGY AND CONSERVATION",
            "termsOffered": "Spring-Even Years Only",
            "description": "Evolution and ecology of tropical ecosystems. Mechanisms that maintain tropical diversity, species interactions, anthropogenic impacts, and conservation strategies.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 205", "BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "447",
            "courseTitle": "TROPICAL FIELD ECOLOGY",
            "termsOffered": "Summer",
            "description": "Field course set in the tropical rainforest. Includes exploration of different tropical ecosystems and training in techniques to carry out independent field research projects.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 205", "BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "450",
            "courseTitle": "ECOLOGICAL BIOCHEMISTRY",
            "termsOffered": "No Longer Offered",
            "description": "Examining diversity of natural products involved in biochemical interactions between plants, animals (including insects, humans, and other herbivores) and microbial flora. Effects that changes in the chemistry of these compounds have on function in ecological systems.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 333", "CHEM 333L", "CHEM 330", "BIOL 200", "BIOL 200L", "BIOL 201", "BIOL 206", "BIOL 206L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "452",
            "courseTitle": "WETLAND ECOLOGY",
            "termsOffered": "Fall-Odd Years Only",
            "description": "Wetland ecology and wetland management, with special focus on wetlands of the Mid-Atlantic region. Emphasis is on biological, physical, chemical, and ecological aspects of wetlands. Course also deals with valuation, classification, delineation and management of wetlands for biotic resources and water management.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 205", "BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "455",
            "courseTitle": "FISH BIOLOGY",
            "termsOffered": "Spring-Even Years Only",
            "description": "Evolutionary history, functional biology, ecology, and conservation of fishes. Weekend field trips required.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 207", "BIOL 208", "CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "456",
            "courseTitle": "ORNITHOLOGY",
            "termsOffered": "Occasionally",
            "description": "Evolutionary history, morphology, physiology, behavior and ecology of birds. One day-long weekend field trip and several early morning weekday field trips required.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202", "BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "458",
            "courseTitle": "MAMMALOGY",
            "termsOffered": "Spring-Odd Years Only",
            "description": "Evolution, comparative morphology, systematics, and distribution of mammals. Representative life histories are considered. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "461",
            "courseTitle": "ENTOMOLOGY",
            "termsOffered": "Fall-Even Years Only",
            "description": "Emphasis on entomology as an interdisciplinary science by including reviews of the major subdivisions within the discipline, including systematics, ecology, behavior, comparative biology and control. Laboratory emphasizes field work for collection of insects and identification and recognition of insect orders and common families. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L", "BIOL 202"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "463",
            "courseTitle": "DEVELOPMENTAL BIOLOGY",
            "termsOffered": "Spring-Odd Years Only",
            "description": "Embryonic development of animals, including differentiation, morphogenesis, pattern formation, and organogenesis. Emphasis on cellular and molecular mechanisms governing these processes. Average of two recitation hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309", "BIOL 325", "BIOL 343"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "467",
            "courseTitle": "HERPETOLOGY",
            "termsOffered": "Spring-Odd Years Only",
            "description": "Systematic survey of the modern reptiles and amphibians. Emphasis is placed on the evolution of morphological and behavioral traits which have enabled the reptiles and amphibians to successfully exploit their individual habitats. Laboratory includes systematic classification, student seminars and field work. Average of three laboratory hours per week.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "470",
            "courseTitle": "ADVANCED PHYSIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Physiological topics discussed at the molecular, cellular, organ, organ system, and whole organism levels. Emphasis on integrating knowledge gained in prerequisite physiology courses and recent discoveries. The recitation component will emphasize the scientific method, data interpretation, and quantitative skills. Topics may include: osmoregulation, gas exchange, general and specific metabolism, thermoregulation, locomotion and regulation via the neural and endocrine systems. Students who have successfully completed BIOL 465 or BIOL 469 will not receive additional credit for BIOL 470.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 343", "BIOL 325", "CHEM 132", "CHEM 132L", "senior status", "CHEM 332", "BIOL 207", "BIOL 208"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "471",
            "courseTitle": "ADVANCED PHYSIOLOGY LABORATORY",
            "termsOffered": "Spring-Even Years Only",
            "description": "Hands-on investigation of physiological principles at the cellular, organ, organ system and whole organism levels. Course meets for 4 hours once per week.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 470"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "472",
            "courseTitle": "ORGANISMAL FORM AND FUNCTION LABORATORY",
            "termsOffered": "Fall-Even Years Only",
            "description": "Using locally collected invertebrate organisms this course will examine the details of animal movement (running, jumping, flying, feeding) with high-speed cameras. Students will develop their own research questions based upon species collected, and will be guided through data collection, analyses and presentation.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 200", "BIOL 200L", "BIOL 206", "BIOL 206L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "473",
            "courseTitle": "ECOLOGICAL FIELD METHODS LABORATORY",
            "termsOffered": "Fall-Even Years Only",
            "description": "Focuses on inquiry-based ecological field research. Students develop critical thinking skills, ask research questions, and collaborate to carry out inquiry-based research. This process includes discovery, hypothesis forming, learning field techniques, data collection, statistical analysis, and preparing a scientific poster.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 206", "BIOL 206L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "474",
            "courseTitle": "MOLECULAR TECHNIQUES IN ECOLOGY, EVOLUTION, AND CONSERVATION",
            "termsOffered": "Fall-Even Years Only",
            "description": "Designed to introduce students to research in the field of conservation genetics. Students will participate in an ongoing research project using bioinformatic and/or laboratory and data analysis techniques. The goal is to generate data that will facilitate the management of a threatened species.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "475",
            "courseTitle": "GENETICS LABORATORY",
            "termsOffered": "Occasionally",
            "description": "Laboratory and computer-based applications of Mendelian, Molecular, and Population Genetics.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "481",
            "courseTitle": "DIRECTED READINGS BIOLOGY",
            "termsOffered": "Fall & Spring",
            "description": "Independent reading in an area selected by the student in consultation with the instructor. May not be applied toward the Biology major or Biology minor, or M.S. degree in biology.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["minimum of 10 credits in biology", "prior written consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "483",
            "courseTitle": "WORKSHOP IN BIOLOGY",
            "termsOffered": "Occasionally",
            "description": "Intensive study of a specific topic or technique in the biological sciences. Topic varies with instructor. May be repeated once provided a different topic is covered.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["one biology course", "consent of department"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "484",
            "courseTitle": "SEMINAR IN ECOLOGY, EVOLUTION, CONSERVATION AND BEHAVIOR",
            "termsOffered": "Spring",
            "description": "Discussion and analysis of current research in ecology, evolution, conservation biology, and animal behavior.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["12 credit hours in Biology", "including BIOL 206", "BIOL 206L", "consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "485",
            "courseTitle": "SEMINAR IN APPLIED BIOTECHNOLOGY",
            "termsOffered": "Occasionally",
            "description": "Current research articles in cell biology and microbiology are reviewed.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["12 hours in biology", "including one of the following: BIOL 325, BIOL 318, BIOL 408 or BIOL 409", "BIOL 309"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "486",
            "courseTitle": "BIOLOGY MAJORS SEMINAR",
            "termsOffered": "Occasionally",
            "description": "Specific topic examined at the molecular, cellular, organismic and ecological levels of organization. Students will be required to present an oral and written report on an aspect of the topic.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 205", "BIOL 207", "BIOL 208", "junior/senior standing"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "490",
            "courseTitle": "INDEPENDENT RESEARCH",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "Active student participation in original investigation / research project with a faculty mentor. Not for Major or Minor credit. May be repeated for a maximum of 9 units.",
            "units": "9",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of the instructor", "Graded S/U"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "491",
            "courseTitle": "ELECTIVE IN INDEPENDENT RESEARCH",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "Active student participation in original investigation / research project with a faculty mentor. Project culminates in public oral or poster presentation or equivalent. Repeatable for up to 6 units, 3 of which may be used as the equivalent of a 3-unit Biology elective.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "493",
            "courseTitle": "INTERNSHIP IN BIOLOGY",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "Practical application of biology in businesses, industries, and public and private agencies. Not for major or minor credit. May be repeated once for credit to a maximum of 6 units.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["2.75 GPA", "junior or senior standing", "major in Biology", "consent of the biology internship coordinator", "A minimum of 11 units in Biology completed at Towson University"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "494",
            "courseTitle": "TRAVEL STUDY",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "A detailed investigation of field-oriented problems in biology away from the Towson University campus. Locations and topics to be selected by the department and instructors sponsoring the program. May be repeated for a maximum of 3 units.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 117", "BIOL 120", "BIOL 120L", "BIOL 191", "BIOL 191L", "BIOL 200", "BIOL 200L", "or equivalent", "consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "BIOL",
            "catalogNumber": "499",
            "courseTitle": "HONORS SENIOR THESIS IN BIOLOGY",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "Writing of an honors thesis based on individual research done under the direction of a faculty member. Public presentation and defense of thesis required. May not be used toward a Biology Minor or M.S. degree in Biology.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["BIOL 491", "consent of instructor"],
            "corequisites": []
        }
    ]
}