{
    "courses": [
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "100",
            "courseTitle": "CHEMISTRY AND CURRENT PROBLEMS",
            "termsOffered": "Fall & Spring",
            "description": "Chemistry concepts and their application to current topics such as environment, energy, food, and health-related chemistry. Three lecture demonstration hours. Core: Biological & Physical Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "103",
            "courseTitle": "FOUNDATIONS OF CHEMISTRY",
            "termsOffered": "Not Currently Offered",
            "description": "Development of reasoning and quantitative skills for problem solving. Introduction to atomic structure, chemical reactions, chemical nomenclature, formulas, symbols and equations, basic skills of laboratory work. Three lecture hours. Not for credit toward Chemistry major or minor. Does not satisfy University Core requirement. S/U grading.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "104",
            "courseTitle": "INTRODUCTION TO ENVIRONMENTAL CHEMISTRY",
            "termsOffered": "Fall",
            "description": "Principles of chemistry that are relevant to environmental issues, including water quality, nutrient pollution, air pollution, and specific classes of environmental contaminants. Three lecture hours and three laboratory hours. Core: Biological & Physical Sciences. Lab/Class fee will be assessed.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 100"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "115",
            "courseTitle": "HONORS CHEMISTRY FOR ALLIED HEALTH PROFESSIONS I",
            "termsOffered": "Fall-Even Years Only",
            "description": "An introduction to the concepts of general chemistry, including states of matter, atomic structure and periodic table, molecular structure, chemical reactions, intermolecular forces, solutions, buffers and pH and radioactivity. Laboratory includes data handling and chemical and instrumental techniques. May not be used as a prerequisite for the Chemistry major program. Three lecture hours and one three-hour laboratory. Must be admitted to the Honors College. Core: Biological & Physical Sciences. Lab/Class fee will be assessed.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["MATH 115", "MATH 119"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "121",
            "courseTitle": "ALLIED HEALTH CHEMISTRY I LECTURE",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Atomic and molecular structure, stoichiometry, chemical reactions, states of matter, solutions, intermolecular forces, acids, bases and buffers, chemical equilibrium, reaction energies and rates. CHEM 121 is a quantitative course and students are expected to be proficient in algebraic manipulations, exponentials, logarithms and graphical interpretation. Students who have successfully completed the honors version of this course (CHEM 115) will not receive additional credit for this course. Corequisite: CHEM 121L. Core: Biological and Physical Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["CHEM 121L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "121L",
            "courseTitle": "ALLIED HEALTH CHEMISTRY I LABORATORY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Laboratory experiments to support concepts of Allied Health Chemistry I Lecture. Not open to those who successfully completed CHEM 105/ CHEM 115. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 121. Core: Biological and Physical Sciences. Lab/class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["CHEM 121"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "131",
            "courseTitle": "GENERAL CHEMISTRY I LECTURE",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Atomic and molecular structure; theories of bonding, stoichiometry; chemical reactions; gases; solutions. Open to science/math majors/minors only. Not open to those who successfully completed CHEM 110. CHEM 131 is a quantitative course and students are expected to be proficient in algebraic manipulations and graphical interpretation. This course includes three hours of lecture plus one hour of recitation per week. Corequisite: CHEM 131L. Core: Biological & Physical Sciences. Lab/Class fee will be assessed.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["CHEM 131L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "131L",
            "courseTitle": "GENERAL CHEMISTRY I LABORATORY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Laboratory experiments to support concepts of General Chemistry I Lecture. Not open to those who successfully completed CHEM 110. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 131. Core: Biological & Physical Sciences. Lab/class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": [],
            "corequisites": ["CHEM 131"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "132",
            "courseTitle": "GENERAL CHEMISTRY II LECTURE",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Physical properties of liquids, solids and solutions, kinetics, equilibrium, acids and bases, chemical thermodynamics and electrochemistry. Not open to those who successfully completed CHEM 111. CHEM 132 is a quantitative course and students are expected to be proficient in algebraic manipulations, exponentials, logarithms and graphical interpretation. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 132L. Prerequisites: CHEM 131 & CHEM 131L. Core: Biological & Physical Sciences.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 131", "CHEM 131L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "132L",
            "courseTitle": "GENERAL CHEMISTRY II LABORATORY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Laboratory experiments to support concepts of General Chemistry II Lecture. Not open to those who successfully completed CHEM 111. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 132. Core: Biological & Physical Sciences. Lab/class fee will be assessed.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "220",
            "courseTitle": "ANALYTICAL CHEMISTRY [LECTURE]",
            "termsOffered": "Fall & Spring",
            "description": "Theory and practice of statistical analysis, equilibrium and polyprotic acid/base chemistry, titrimetry, chromatography, electrochemistry, and spectrophotometry. Students who have successfully completed CHEM 210 will not receive additional credit for CHEM 220. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 220L. Prerequisites: CHEM 132 and CHEM 132L.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": ["CHEM 220L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "220L",
            "courseTitle": "ANALYTICAL CHEMISTRY [LAB]",
            "termsOffered": "Fall & Spring",
            "description": "Laboratory experiments to support concepts of analytical chemistry. One laboratory-lecture hour, and three hours of laboratory. Students who have successfully completed CHEM 210 will not receive additional credit for CHEM 220L. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 220. Prerequisites: CHEM 132 and CHEM 132L. Lab/Class fee will be assessed.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": ["CHEM 220"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "301",
            "courseTitle": "PROFESSIONAL ETHICS FOR SCIENTISTS",
            "termsOffered": "Spring",
            "description": "Integrity of scientific literature and the responsibilities of scientists to associates and the public. Discussion of principles and case studies emphasizing the physical sciences. Does not count toward Chemistry major or minor. Requires grade of C or better to fulfill Core requirement. Prerequisites: three courses in ASTR, BIOL, CHEM, ENVS, GEOL, PHYS, or PHSC and at least two courses with laboratory; ENGL 102 or ENGL 190 or equivalent. Core: Advanced Writing Seminar.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["ASTR 100", "BIOL 100", "CHEM 100"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "310",
            "courseTitle": "INSTRUMENTAL ANALYSIS",
            "termsOffered": "Fall & Spring",
            "description": "Theory and practice of spectroscopic, chromatographic, and electrochemical instruments, their design and modification to solve practical problems. Three lecture hours and four laboratory hours. Prerequisites: CHEM 220/ CHEM 220L (CHEM 210), and CHEM 333/ CHEM 333L (CHEM 330) or CHEM 334 & CHEM 336 (CHEM 331). Lab/Class fee will be assessed.",
            "units": "4",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "323",
            "courseTitle": "INORGANIC CHEMISTRY",
            "termsOffered": "Fall & Spring",
            "description": "Atomic Structure; Valence-bond, Molecular orbital, and crystal-field theories of bonding; structure and bonding in ionic and metallic solids; chemistry of main-group and transition-metal compounds; acid-base theories; organometallic compounds; syntheses and characterizations of main-group and transition-metal compounds. Three lecture hours and four laboratory hours. Students who have successfully completed CHEM 321 will not receive additional credit for CHEM 323.",
            "units": "5",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "330",
            "courseTitle": "ESSENTIALS OF ORGANIC CHEMISTRY",
            "termsOffered": "Not Currently Offered",
            "description": "A one-term survey course in organic chemistry for non-chemistry majors taught on a conceptual basis. Not part of a traditional two-term organic chemistry sequence. Emphasis will be on principles, mechanisms, and modern techniques. Laboratory will include synthesis and identification of organic compounds. Three lecture hours, one recitation hour, and one three-hour lab. Prerequisites: CHEM 132 and CHEM 132L. Lab/Class fee will be assessed.",
            "units": "5",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "331",
            "courseTitle": "ORGANIC CHEMISTRY I",
            "termsOffered": "Not Currently Offered",
            "description": "Structure, stereochemistry, reactions and their mechanisms, preparation and properties of alkanes, alkenes, alkynes, alkyl halides and alcohols. Laboratory techniques include purification, spectroscopic (IR, NMR) and chromatographic (GLPC) methods of identification, and synthesis. Three lecture hours, one hour of laboratory lecture, and one three-hour lab. CHEM 331 and CHEM 332 comprise a traditional two-term organic chemistry sequence. Prerequisites: CHEM 132 and CHEM 132L. Lab/Class fee will be assessed.",
            "units": "5",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "332",
            "courseTitle": "ORGANIC CHEMISTRY II",
            "termsOffered": "Not Currently Offered",
            "description": "Structure, reactions and their mechanisms, preparation and properties of alcohols, ethers, aldehydes, ketones, carboxylic acids and their derivatives, amines, carbohydrates, etc. Laboratory emphasizes synthetic techniques and modern qualitative organic analysis using chemical reactions and IR, UV, and NMR. Three lecture hours, one hour of laboratory lecture and one three-hour lab. CHEM 331 and CHEM 332 comprise a traditional two-term organic chemistry sequence. Prerequisite: CHEM 331. Lab/Class fee will be assessed.",
            "units": "5",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 331"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "333",
            "courseTitle": "ESSENTIALS OF ORGANIC CHEM [LECTURE]",
            "termsOffered": "Fall, Spring & Summer",
            "description": "A one-term survey course in organic chemistry for non-chemistry majors taught on a conceptual basis. Not part of a traditional two-term organic chemistry sequence. Emphasis will be on principles, mechanisms, and modern techniques. Three lecture hours. Not open to students who have successfully completed CHEM 330. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 333L or successful completion of CHEM 333L or CHEM 336; students are required to be enrolled in both lecture and lab until two weeks prior to the final withdrawal date.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": ["CHEM 333L"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "333L",
            "courseTitle": "ESSENTIALS OF ORGANIC CHEMISTRY LABORATORY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Lab for a one-term survey course in organic chemistry for non-chemistry majors taught on a conceptual basis. Not part of a traditional two-term organic chemistry sequence. Emphasis will be on principles, mechanisms, and modern techniques. Laboratory will include synthesis and identification of organic compounds. One hour of laboratory lecture and one three-hour lab. Not open to students who have successfully completed CHEM 330. Withdrawal from either Lec or Lab is possible only after Change of Schedule. Corequisite: CHEM 333.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": ["CHEM 333"]
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "334",
            "courseTitle": "ORGANIC CHEMISTRY I [LECTURE]",
            "termsOffered": "Fall & Spring",
            "description": "Structure, stereochemistry, reactions and their mechanisms, preparation and properties of alkanes, alkenes, alkynes, alkyl halides and alcohols. Three lecture hours. CHEM 334 and CHEM 337 comprise a traditional two-term organic chemistry lecture sequence with the CHEM 336 and CHEM 339 labs. Not open to students who have successfully completed CHEM 331.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "336",
            "courseTitle": "INTRODUCTORY ORGANIC CHEMISTRY LABORATORY",
            "termsOffered": "Fall & Spring",
            "description": "Structure, stereochemistry, reactions and their mechanisms, preparation and properties of alkanes, alkenes, alkynes, alkyl halides and alcohols. Laboratory techniques include purification, spectroscopic (IR, NMR) and chromatographic (GLPC) methods of identification, and synthesis. One hour of laboratory lecture and one three-hour lab. CHEM 334 and CHEM 337 comprise a traditional two-term organic chemistry lecture sequence with the CHEM 336 and CHEM 339 labs. Not open to students who have successfully completed CHEM 331.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 334"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "337",
            "courseTitle": "ORGANIC CHEMISTRY II [LECTURE]",
            "termsOffered": "Fall & Spring",
            "description": "Structure, reactions and their mechanisms, preparation and properties of alcohols, ethers, aldehydes, ketones, carboxylic acids and their derivatives, amines, conjugated and aromatic compounds. Three lecture hours. CHEM 334 and CHEM 337 comprise a traditional two-term organic chemistry lecture. Not open to students who have successfully completed CHEM 332.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 334"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "339",
            "courseTitle": "INTERMEDIATE ORGANIC CHEMISTRY LABORATORY",
            "termsOffered": "Fall & Spring",
            "description": "Structure, reactions and their mechanisms, preparation and properties of alcohols, ethers, aldehydes, ketones, carboxylic acids and their derivatives, amines, conjugated and aromatic compounds. Laboratory emphasizes synthetic techniques and spectroscopic characterization and identification of compounds using IR, mass spectrometry, and 1H and 13C NMR. One hour of laboratory lecture and one three-hour lab. CHEM 334 and CHEM 337 comprise a traditional two-term organic chemistry lecture sequence with the CHEM 336 and CHEM 339 labs. Not open to students who have successfully completed CHEM 332.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 336", "CHEM 337"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "345",
            "courseTitle": "PRINCIPLES OF PHYSICAL CHEMISTRY",
            "termsOffered": "Fall & Spring",
            "description": "Empirical derivations of the unifying physical principles of chemistry. Topics of particular interest include the principles of thermodynamics, chemical kinetics, quantum mechanics and spectroscopy, and their applications in chemical systems. Quantitative problem solving involving integral and differential calculus is emphasized.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 132", "CHEM 132L", "MATH 211", "MATH 273", "PHYS 211", "PHYS 241"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "346",
            "courseTitle": "THEORETICAL FOUNDATIONS OF PHYSICAL CHEMISTRY",
            "termsOffered": "Spring",
            "description": "Theoretical principles unifying the vast body of chemical observations. Extensive use of differential and integral calculus in developing mathematical models describing the behavior of chemical systems.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 345", "MATH 274", "PHYS 212", "PHYS 242"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "351",
            "courseTitle": "BIOCHEMISTRY",
            "termsOffered": "Fall & Spring",
            "description": "Chemical processes in biological systems including biological buffers, protein structure, ligand binding, enzyme kinetics, carbohydrate chemistry, membrane structure, bioenergetics, analytical methods, and principles of metabolism applied to pathways. Three lecture hours.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 330", "CHEM 332", "CHEM 333", "CHEM 333L", "CHEM 336", "CHEM 337"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "356",
            "courseTitle": "BIOCHEMISTRY LAB",
            "termsOffered": "Spring",
            "description": "Physical methods in biochemistry including spectrophotometry, centrifugation and ultra-centrifugation, electrophoresis, and chromatography. Isolation and purification of proteins and nucleic acids. Enzyme kinetics and the binding of small molecules to macromolecules. One lecture hour and three laboratory hours.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 351"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "357",
            "courseTitle": "ADVANCED BIOCHEMISTRY",
            "termsOffered": "Fall & Spring",
            "description": "Selected topics in biochemistry with an emphasis on understanding the behavior of macromolecules at the molecular level. Introduces the use of numerical principles to study the conformation and interactions of macromolecules. Topics include macromolecular transitions, ligand binding, cooperativity, structure-function relationships of selected molecules, and current literature readings.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 351"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "372",
            "courseTitle": "PHYSICAL CHEMISTRY LABORATORY",
            "termsOffered": "Fall & Spring",
            "description": "Introductory experiments in physical chemistry involving thermodynamics, kinetics and spectroscopy to characterize properties of materials and chemical systems. Four laboratory-lecture hours.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L", "CHEM 345"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "391",
            "courseTitle": "SPECIAL PROBLEMS IN CHEMISTRY I",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "A laboratory or library problem in chemistry to be selected by the student in consultation with the instructor. Students are required to submit a written report. May be repeated for a maximum of 6 units provided a different topic is taken.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of the instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "392",
            "courseTitle": "SPECIAL PROBLEMS IN CHEMISTRY II",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "A laboratory or library problem in chemistry to be selected by the student in consultation with the instructor. Students are required to submit a written report. May be repeated for a maximum of 6 units.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of the instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "393",
            "courseTitle": "SPECIAL PROBLEMS IN CHEMISTRY III",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "A laboratory or library problem in chemistry to be selected by the student in consultation with the instructor. Students are required to submit a written report. May be repeated for a maximum of 6 units.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of the instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "394",
            "courseTitle": "SPECIAL PROBLEMS IN CHEMISTRY IV",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "A laboratory or library problem in chemistry to be selected by the student in consultation with the instructor. Students are required to submit a written report. May be repeated for a maximum of 6 units.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of the instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "395",
            "courseTitle": "INTERNSHIP IN CHEMISTRY",
            "termsOffered": "Fall, Spring & Summer",
            "description": "Students will be given credit in this cooperative education program for approved experience in chemistry or forensic chemistry in the private or public sector. A written report of their work will be submitted by students and evaluated by the Chemistry or Forensic Chemistry Faculty. May be repeated once for a maximum of 6 units. Graded S/U.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L", "CHEM 332", "3.0 GPA overall", "Junior class standing"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "401",
            "courseTitle": "COMMUNICATION SKILLS IN CHEMISTRY",
            "termsOffered": "Fall",
            "description": "Effective scientific communication skills will be developed, culminating in student presentations to the Chemistry Department. Topics will be selected from chemical literature. Attendance at departmental seminars is required.",
            "units": "1",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L", "CHEM 337", "CHEM 339"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "461",
            "courseTitle": "ADVANCED LECTURE TOPICS",
            "termsOffered": "Fall & Spring",
            "description": "Advanced studies in one of the major topics in chemistry. Content will depend on instructor. This course may be repeated for a maximum of 9 units with a different topic.",
            "units": "9",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 332"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "462",
            "courseTitle": "ADVANCED LABORATORY TECHNIQUES",
            "termsOffered": "Occasionally",
            "description": "An advanced, focused laboratory in chemistry. Content will depend on the instructor. This course may be repeated for a maximum of 6 units as a laboratory experience with a different focus.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 332", "CHEM 372", "Consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "472",
            "courseTitle": "APPLICATIONS OF ENVIRONMENTAL CHEMISTRY",
            "termsOffered": "Spring",
            "description": "Fate and transport of chemical contaminants; physico-chemical processes controlling pollutant partitioning and distribution; implications of chemical speciation on toxicity to biota.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 220", "CHEM 220L", "CHEM 333", "CHEM 333L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "480",
            "courseTitle": "CHEMICAL TOXICOLOGY",
            "termsOffered": "Fall",
            "description": "Study of the fate, effects, and mechanisms of action of toxicants; physical and biological factors affecting transport, transformation and toxicity of chemical stressors; emphasis on forensic and environmental applications.",
            "units": "3",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["CHEM 351", "BIOL 200", "BIOL 200L"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "491",
            "courseTitle": "RESEARCH IN CHEMISTRY",
            "termsOffered": "Fall, Winter, Spring & Summer",
            "description": "An original experimental or theoretical investigation to be conducted under the supervision of a chemistry or forensic chemistry faculty member. Projects may span multiple semesters, and students may repeat the course for credit provided a different topic description is specified for each semester. A student should expect to complete a formal written report and/or presentation.",
            "units": "15",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "495",
            "courseTitle": "INDEPENDENT STUDY IN CHEMISTRY",
            "termsOffered": "Occasionally",
            "description": "Studies in selected content areas tailored to student needs. May be repeated for a maximum of 6 units.",
            "units": "6",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Permission of instructor"],
            "corequisites": []
        },
        {
            "institution": "TOWSN",
            "acadCareer": "UGRD",
            "subject": "CHEM",
            "catalogNumber": "499",
            "courseTitle": "HONORS THESIS IN CHEMISTRY",
            "termsOffered": "Fall & Spring",
            "description": "Writing of an honors thesis based on independent research done under the direction of a faculty member. Oral presentation of the work in a public seminar. Honors College course.",
            "units": "2",
            "gradingBasis": "UNDERGRADUATE GRADING",
            "campusCode": "MAIN",
            "prerequisites": ["Consent of instructor", "Open only to students who have been approved as departmental honors candidates"],
            "corequisites": []
        }
    ]
}