{
    "coreCurriculumRequirements": {
        "totalUnits": "43-46",
        "categories": [
            {
                "category": "Fundamentals",
                "requirements": [
                    {
                        "name": "Towson Seminar",
                        "code": "(1)",
                        "units": 3,
                        "minimumGrade": "C",
                        "description": "Introduces students to college-level work and academic expectations.",
                        "courses": [
                            "TSEM 102",
                            "TSEM 190 Honors Towson Seminar"
                        ],
                        "learningOutcomes": [
                            "Prepare and present a compelling substantive interpretation, argument, and/or analysis of a problem or issue in a research paper.",
                            "Gather and use academic resources effectively and according to the standards and rules of academic integrity.",
                            "Understand and evaluate the nature and possible causes and implications of events, behavior, problems, and issues from an informed and balanced perspective.",
                            "Connect concepts and empirical evidence in logically coherent, valid, and compelling ways.",
                            "Understand and appreciate social and cultural differences and engage constructively with others from different backgrounds.",
                            "Participate responsibly and effectively in group efforts to address and solve problems."
                        ]
                    },
                    {
                        "name": "English Composition",
                        "code": "(2)",
                        "units": 3,
                        "minimumGrade": "C",
                        "description": "Focuses on writing and thinking in the branches of knowledge and developing rhetorical strategies for expository writing.",
                        "courses": [
                            "ENGL 102",
                            "ENGL 190 Honors Writing Seminar"
                        ],
                        "learningOutcomes": [
                            "Write academic essays that effectively and appropriately respond to specific rhetorical situations.",
                            "Improve literacy skills, including the ability to read and analyze a variety of texts.",
                            "Organize an essay around a sound central idea supported by relevant material.",
                            "Organize supporting material with a discernible and logical plan.",
                            "Present ideas in complex and effective sentences relatively free from mechanical errors.",
                            "Support and share ideas and opinions with confidence."
                        ]
                    },
                    {
                        "name": "Mathematics",
                        "code": "(3)",
                        "units": "3-4",
                        "description": "Requires skills at the level of college algebra or above, emphasizing both theoretical foundations and problem-solving applications.",
                        "courses": [
                            "ECON 205",
                            "MATH 105",
                            "MATH 109",
                            "MATH 111",
                            "MATH 115",
                            "MATH 119",
                            "MATH 205",
                            "MATH 211",
                            "MATH 231",
                            "MATH 233",
                            "MATH 237",
                            "MATH 273",
                            "MATH 274",
                            "MATH 283",
                            "MATH 293"
                        ],
                        "learningOutcomes": [
                            "Construct and evaluate logical arguments.",
                            "Apply and adapt a variety of appropriate strategies to solve mathematical problems.",
                            "Recognize and apply mathematics in contexts outside of mathematics.",
                            "Organize and consolidate mathematical thinking through written and oral communication."
                        ]
                    },
                    {
                        "name": "Creativity and Creative Development",
                        "code": "(4)",
                        "units": 3,
                        "description": "Emphasizes symbolic, affective, and imaginative thinking in creative activity and understanding the creative process through participation.",
                        "courses": [
                            "ART 102",
                            "ART 103",
                            "ART 106",
                            "ART 107",
                            "ART 109",
                            "ART 113",
                            "ART 114",
                            "ART 117",
                            "ART 118",
                            "ART 146",
                            "ART 147",
                            "ART 156",
                            "ART 157",
                            "ART 161",
                            "COMM 233",
                            "COSC 109",
                            "DANC 106",
                            "DANC 235",
                            "EMF 110",
                            "ENGL 283",
                            "ENGL 311",
                            "ENGL 312",
                            "ENGL 315",
                            "ENGL 332",
                            "HONR 225",
                            "IDFA 203",
                            "MUSC 105",
                            "MUSC 116",
                            "MUSC 287",
                            "THEA 101",
                            "THEA 102",
                            "THEA 142",
                            "THEA 204"
                        ],
                        "learningOutcomes": [
                            "Apply in practice a range of expression within a specific art while exhibiting rigorous standards of technique.",
                            "Demonstrate content knowledge through an analysis and synthesis of representative examples, ideas, and skills.",
                            "Articulate the ways in which theory and practice meet in the creation of the specific art form.",
                            "Show how history, aesthetics, form and composition, techniques, and pedagogy contribute to the process of creative development."
                        ]
                    }
                ]
            },
            {
                "category": "Ways of Knowing",
                "requirements": [
                    {
                        "name": "Arts and Humanities",
                        "code": "(5)",
                        "units": 3,
                        "description": "Explores aesthetics, values, and cultural heritage through subjects like literature, art, music, and philosophy.",
                        "courses": [
                            "ARAB 101",
                            "ARAB 201",
                            "ARAB 301",
                            "ARTH 105",
                            "ARTH 109",
                            "ARTH 221",
                            "ARTH 222",
                            "CHNS 101",
                            "CHNS 201",
                            "CHNS 301",
                            "COMM 131",
                            "COMM 132",
                            "DANC 101",
                            "DANC 105",
                            "DANC 130",
                            "DFST 104",
                            "DFST 114",
                            "EMF 313",
                            "ENGL 205",
                            "ENGL 221",
                            "ENGL 222",
                            "ENGL 240",
                            "ENGL 243",
                            "ENGL 244",
                            "ENGL 261",
                            "ENGL 263",
                            "ENGL 290",
                            "FORL 101",
                            "FORL 201",
                            "FREN 101",
                            "FREN 201",
                            "FREN 301",
                            "GERM 101",
                            "GERM 201",
                            "GERM 301",
                            "GRK 103",
                            "GRK 203",
                            "HEBR 101",
                            "HEBR 103",
                            "HEBR 201",
                            "HEBR 203",
                            "HEBR 301",
                            "HIST 101",
                            "HIST 102",
                            "HIST 103",
                            "HIST 206",
                            "HONR 235",
                            "ITAL 101",
                            "ITAL 201",
                            "ITAL 301",
                            "JPNS 101",
                            "JPNS 201",
                            "JPNS 301",
                            "LATN 101",
                            "LATN 201"
                        ],
                        "learningOutcomes": [
                            "Discuss the context and structures of cultural traditions in terms of literature, art, music, culture, or society.",
                            "Describe important movements and processes that have affected the cultural heritage of a particular group.",
                            "Use methodologies associated with the study of cultural traditions in the arts and humanities.",
                            "Engage in a critical assessment of how the student’s own experience has been affected by particular cultural traditions in the arts and humanities."
                        ]
                    }
                ]
            },
            {
                "category": "Ways of Knowing",
                "requirements": [
                    {
                        "name": "Social and Behavioral Sciences",
                        "code": "(6)",
                        "units": 3,
                        "description": "Examines the psychology of individuals and the ways in which individuals, groups, or segments of society behave, function, and influence one another.",
                        "courses": [
                            "CRMJ 201",
                            "ECON 201",
                            "ECON 202",
                            "ECON 203",
                            "ECON 204",
                            "FMST 101",
                            "FMST 102",
                            "GEOG 201",
                            "GERO 101",
                            "HIST 280",
                            "LING 111",
                            "MCOM 101",
                            "POSC 101",
                            "POSC 102",
                            "PSYC 101",
                            "PSYC 102",
                            "SOCI 101",
                            "SOCI 102"
                        ],
                        "learningOutcomes": [
                            "Articulate relevant basic assumptions, concepts, theoretical constructs, and factual information of the social and behavioral sciences.",
                            "Demonstrate an understanding of relevant social and behavioral science methodologies.",
                            "Apply appropriate problem-solving skills in discipline-specific contexts.",
                            "Apply disciplinary knowledge from the social and behavioral sciences to contemporary ethical or social issues."
                        ]
                    },
                    {
                        "name": "Biological and Physical Sciences (with Lab)",
                        "code": "(7)",
                        "units": "4-5",
                        "description": "Investigates living systems and the physical universe, emphasizing scientific inquiry, historical development, and application of scientific concepts.",
                        "courses": [
                            "ASTR 161",
                            "ASTR 181",
                            "BIOL 117",
                            "BIOL 120 + 120L",
                            "BIOL 191 + 191L",
                            "BIOL 192",
                            "BIOL 200 + 200L",
                            "BIOL 203",
                            "BIOL 206 + 206L",
                            "CHEM 104",
                            "CHEM 115",
                            "CHEM 121 + 121L",
                            "CHEM 131 + 131L",
                            "CHEM 132 + 132L",
                            "GEOL 121",
                            "GEOL 122",
                            "GEOL 123",
                            "PHSC 101",
                            "PHYS 131",
                            "PHYS 143",
                            "PHYS 202",
                            "PHYS 211",
                            "PHYS 212",
                            "PHYS 241",
                            "PHYS 242",
                            "PHYS 251",
                            "PHYS 252"
                        ],
                        "learningOutcomes": [
                            "Utilize scientific vocabulary and examples to describe major ideas appropriate to a specific scientific discipline.",
                            "Use quantitative reasoning to analyze and/or support scientific information.",
                            "Identify, describe, critique, respond to, and construct the various components of the scientific process.",
                            "Explain scientific issues of current importance to society within scientific, technological, historical, societal, and ethical contexts."
                        ]
                    },
                    {
                        "name": "Biological and Physical Sciences (Lab & Non-Lab)",
                        "code": "(8)",
                        "units": "3-4",
                        "description": "Focuses on scientific inquiry and understanding, with an emphasis on non-lab courses or additional lab sciences from a different discipline.",
                        "courses": [
                            "ANTH 212",
                            "ASTR 161",
                            "ASTR 181",
                            "BIOL 105",
                            "BIOL 117",
                            "BIOL 120",
                            "BIOL 191 + 191L",
                            "BIOL 192",
                            "BIOL 200 + 200L",
                            "BIOL 203",
                            "BIOL 206 + 206L",
                            "CHEM 100",
                            "CHEM 104",
                            "CHEM 115",
                            "CHEM 121 + 121L",
                            "CHEM 131 + 131L",
                            "CHEM 132 + 132L",
                            "GEOG 101",
                            "GEOL 109",
                            "GEOL 121",
                            "GEOL 122",
                            "GEOL 123",
                            "HONR 227",
                            "HONR 301",
                            "PHSC 101",
                            "PHYS 100",
                            "PHYS 103",
                            "PHYS 131",
                            "PHYS 143",
                            "PHYS 202",
                            "PHYS 211",
                            "PHYS 212",
                            "PHYS 241",
                            "PHYS 242",
                            "PHYS 251",
                            "PHYS 252"
                        ],
                        "learningOutcomes": [
                            "Understand and evaluate the processes of scientific inquiry in non-lab settings.",
                            "Demonstrate comprehension of major scientific ideas and methodologies.",
                            "Analyze current scientific challenges from a variety of perspectives.",
                            "Connect theoretical knowledge with practical applications in scientific studies."
                        ]
                    }
                ]
            },
            {
                "category": "Writing in a Chosen Field",
                "requirements": [
                    {
                        "name": "Advanced Writing Seminar",
                        "code": "(9)",
                        "units": "3-4",
                        "description": "Focuses on discipline-specific writing practices and techniques of formatting, reporting, and documentation.",
                        "courses": [
                            "AADS 405",
                            "AHLT 440",
                            "ANTH 401",
                            "ART 351",
                            "BIOL 381",
                            "BUSX 301",
                            "CHEM 301",
                            "CLST 300",
                            "COMM 300",
                            "DANC 321",
                            "ECED 422",
                            "EDUC 301",
                            "ELED 320",
                            "EMF 377",
                            "ENGL 310",
                            "ENGL 313",
                            "ENGL 314",
                            "ENGL 316",
                            "ENGL 317",
                            "ENGL 318",
                            "FMST 485",
                            "GEOG 383",
                            "GEOG 401",
                            "HIST 300",
                            "HLTH 315",
                            "KNES 351",
                            "KNES 353",
                            "KNES 354",
                            "KNES 417",
                            "KNES 469",
                            "LING 320",
                            "MATH 310",
                            "MCOM 356",
                            "MCOM 357",
                            "MUED 311",
                            "NURS 333",
                            "OCTH 430",
                            "PHIL 460",
                            "PHSC 312",
                            "POSC 376",
                            "PSYC 313",
                            "PSYC 314",
                            "RLST 354",
                            "RLST 411",
                            "SOCI 300",
                            "SPPA 417",
                            "THEA 307",
                            "WMST 333"
                        ],
                        "learningOutcomes": [
                            "Recognize and employ models and practices of written communication specific to a particular discipline or profession.",
                            "Recognize and employ techniques of formatting and documentation appropriate to a particular discipline or profession.",
                            "Integrate material effectively from outside sources into their own prose.",
                            "Analyze and evaluate complex discipline-based claims and current research questions.",
                            "Compose clear, effective prose, including through the practice of revision."
                        ]
                    }
                ]
            },
            {
                "category": "Perspectives",
                "requirements": [
                    {
                        "name": "Metropolitan Perspectives",
                        "code": "(10)",
                        "units": 3,
                        "description": "Explores the complexities of metropolitan environments, past and present, through diverse disciplines.",
                        "courses": [
                            "EDUC 202",
                            "EDUC 204",
                            "EMF 215",
                            "ENGL 347",
                            "FMST 201",
                            "GEOG 251",
                            "HIST 202",
                            "HIST 203",
                            "HIST 210",
                            "HIST 337",
                            "HIST 338",
                            "HIST 375",
                            "HIST 390",
                            "HONR 229",
                            "HLTH 350",
                            "IDFA 201",
                            "ITEC 201",
                            "KNES 320",
                            "LING 330",
                            "MTRO 101",
                            "MUSC 117",
                            "PHIL 260",
                            "PHIL 290",
                            "POSC 304",
                            "POSC 305"
                        ],
                        "learningOutcomes": [
                            "Explain characteristic features of a metropolis and explore how persistent problems, institutional transformations, and creative expression may emerge from this environment.",
                            "Interpret, evaluate, compare, and critique the views and experiences of particular social, economic, and cultural groups in the metropolis.",
                            "Articulate how individuals or groups influence public decisions in the metropolis or contribute to community well-being.",
                            "Apply critical analysis to specific topics or questions related to metropolitan challenges and developments."
                        ]
                    },
                    {
                        "name": "United States as a Nation",
                        "code": "(11)",
                        "units": 3,
                        "description": "Explores institutions, history, culture, or traditions of the United States and addresses broader national experiences.",
                        "courses": [
                            "AMST 201",
                            "ANTH 209",
                            "ARTH 113",
                            "CLST 201",
                            "CLST 202",
                            "CRMJ 254",
                            "DANC 127",
                            "ENGL 238",
                            "FMST 315",
                            "HIST 145",
                            "HIST 146",
                            "HIST 147",
                            "HIST 148",
                            "HLTH 101",
                            "HLTH 102",
                            "HLTH 207",
                            "HLTH 217",
                            "HONR 230",
                            "KNES 235",
                            "KNES 251",
                            "LEGL 225",
                            "MUSC 111",
                            "MUSC 123",
                            "MUSC 125",
                            "MUSC 201",
                            "MUSC 204",
                            "POSC 103",
                            "POSC 207",
                            "POSC 209",
                            "POSC 212",
                            "POSC 343",
                            "RLST 204",
                            "RLST 225",
                            "RLST 320",
                            "SOCI 210",
                            "THEA 103",
                            "WMST 235"
                        ],
                        "learningOutcomes": [
                            "Characterize the United States as a nation, including through comparison with other societies and cultures.",
                            "Define and discuss major issues involving American experiences past or present from multiple perspectives.",
                            "Demonstrate specific knowledge pertinent to central issues of the course and use that knowledge in substantive analysis."
                        ]
                    },
                    {
                        "name": "Global Perspectives",
                        "code": "(12)",
                        "units": 3,
                        "description": "Examines changing global environments and relationships shaped by major social, cultural, and technological forces.",
                        "courses": [
                            "ANTH 207",
                            "ANTH 210",
                            "ARAB 102",
                            "ARAB 202",
                            "ARAB 302",
                            "ARTH 107",
                            "ASST 201",
                            "CHNS 102",
                            "CHNS 202",
                            "CHNS 302",
                            "DANC 125",
                            "ENGL 229",
                            "ENGL 241",
                            "ENGL 246",
                            "ENGL 248",
                            "ENGL 348",
                            "FMST 210",
                            "FORL 102",
                            "FORL 202",
                            "FORL 360",
                            "FREN 102",
                            "FREN 202",
                            "FREN 302",
                            "GEOG 102",
                            "GEOG 105",
                            "GEOG 109",
                            "GEOG 110",
                            "GEOG 112",
                            "GERM 102",
                            "GERM 202",
                            "GERM 302",
                            "GRK 104",
                            "GRK 204",
                            "HEBR 102",
                            "HEBR 104",
                            "HEBR 202",
                            "HEBR 204",
                            "HEBR 302",
                            "HIST 110",
                            "HIST 111",
                            "HIST 117",
                            "HIST 118",
                            "HIST 121",
                            "HIST 122",
                            "HIST 135",
                            "HIST 136",
                            "HIST 160",
                            "HIST 161",
                            "HIST 342",
                            "HONR 243",
                            "ITAL 102",
                            "ITAL 202",
                            "ITAL 302",
                            "JPNS 102",
                            "JPNS 202",
                            "JPNS 302",
                            "KNES 285",
                            "LAST 100",
                            "LATN 102",
                            "LATN 202",
                            "LATN 302",
                            "MUSC 202",
                            "PHIL 219",
                            "PORT 102",
                            "PORT 202",
                            "POSC 105",
                            "POSC 107",
                            "POSC 108",
                            "RLST 105",
                            "RLST 203",
                            "RLST 207",
                            "RLST 208",
                            "RUSS 102",
                            "RUSS 202",
                            "RUSS 302",
                            "SPAN 102",
                            "SPAN 202",
                            "SPAN 204",
                            "SPAN 302",
                            "SPAN 304",
                            "WMST 233"
                        ],
                        "learningOutcomes": [
                            "Examine the influence of major global forces on social, cultural, and technological relationships.",
                            "Develop an understanding of the global context and patterns transforming relations among nations and cultures.",
                            "Analyze their own society's relationship with the global context and make informed decisions reflecting this understanding."
                        ]
                    },
                    {
                        "name": "Diversity and Difference",
                        "code": "(13)",
                        "units": 3,
                        "description": "Explores relationships of distinctiveness and interdependence, conflict, and cooperation among diverse cultures and identities.",
                        "courses": [
                            "AFST 201",
                            "ARTH 108",
                            "DANC 210",
                            "DFST 101",
                            "EDUC 203",
                            "EMF 205",
                            "EMF 210",
                            "ENGL 233",
                            "ENGL 234",
                            "ENGL 235",
                            "ENGL 239",
                            "FMST 310",
                            "FMST 311",
                            "FMST 360",
                            "FMST 465",
                            "FORL 325",
                            "HLTH 220",
                            "HONR 240",
                            "IDHP 300",
                            "KNES 441",
                            "LGBT 101",
                            "MUSC 205",
                            "MUSC 115",
                            "NURS 416",
                            "PHIL 204",
                            "RLST 205",
                            "RLST 206",
                            "RLST 209",
                            "RLST 210",
                            "SOCI 241",
                            "SOCI 243",
                            "THEA 303",
                            "THEA 304",
                            "THEA 316",
                            "THEA 380",
                            "WMST 231",
                            "WMST 232"
                        ],
                        "learningOutcomes": [
                            "Discuss ways in which group distinctiveness is defined in social contexts.",
                            "Demonstrate understanding of perspectives other than their own.",
                            "Present and respond to differing positions in a fair and balanced argument.",
                            "Define challenges and opportunities arising from diversity and difference.",
                            "Articulate their own beliefs and assumptions in relation to course topics."
                        ]
                    },
                    {
                        "name": "Ethical Issues and Perspectives",
                        "code": "(14)",
                        "units": 3,
                        "description": "Focuses on ethical issues of current importance and develops techniques for reaching sound judgments.",
                        "courses": [
                            "ARED 377",
                            "ASTR 301",
                            "BIOL 306",
                            "CLST 311",
                            "COMM 220",
                            "COSC 418",
                            "ENGL 301",
                            "ENGL 305",
                            "FMST 325",
                            "HCMN 441",
                            "HIST 200",
                            "HIST 205",
                            "HIST 330",
                            "HONR 345",
                            "IDHP 325",
                            "LIBR 300",
                            "MNGT 482",
                            "MUSC 355",
                            "PHIL 103",
                            "PHIL 212",
                            "PHIL 255",
                            "PHIL 340",
                            "PHIL 342",
                            "PHIL 361",
                            "PHIL 371",
                            "RLST 305",
                            "RLST 310",
                            "RLST 313",
                            "SCED 304",
                            "THEA 310",
                            "WMST 382",
                            "WMST 383"
                        ],
                        "learningOutcomes": [
                            "Analyze evidence from various sources on ethical issues, including opposing viewpoints.",
                            "Evaluate persuasive rhetoric and construct counter-arguments.",
                            "Understand ethical dimensions of significant issues or dilemmas.",
                            "Propose solutions to problems within an informed ethical context.",
                            "Communicate arguments and conclusions effectively and clearly."
                        ]
                    }
                ]
            }
        ]
    }
}
